Tekla.Structures.Drawing.PlacingDistanceAttributes.SearchMargin
The search marginal for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.MinimalDistance
The minimal distance for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.MaximalDistance
The maximal distance for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.#ctor
Creates a new placing distance attributes instance. The default values are a 0.0 search
margin and a 0.0 minimal distance.